Revit 2027 API
AnalysisDisplayColorEntry(Color) Constructor
 Constructs a color entry with no value assigned.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColorEntry(
	Color color
)
Public Sub New (
	color As Color
)
public:
AnalysisDisplayColorEntry(
	Color^ color
)
new :
        color : Color -> AnalysisDisplayColorEntry
Parameters
color Color
 Color assigned to the entry.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayColorEntry Class
AnalysisDisplayColorEntry Overload
Autodesk.Revit.DB.Analysis Namespace